hr13/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "0.1/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

11
(
    side01
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          4800;
        startFace       779262;
    }
    side02
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          4800;
        startFace       784062;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          5684;
        startFace       788862;
    }
    top
    {
        type            patch;
        nFaces          4800;
        startFace       794546;
    }
    inlet
    {
        type            patch;
        nFaces          1600;
        startFace       799346;
    }
    outlet
    {
        type            patch;
        nFaces          1600;
        startFace       800946;
    }
    roomBackFace
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2240;
        startFace       802546;
    }
    roomBottomFace
    {
        type            wall;
        inGroups        1(wall);
        nFaces          616;
        startFace       804786;
    }
    roomSide01
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1760;
        startFace       805402;
    }
    roomSide02
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1760;
        startFace       807162;
    }
    roomTopFace
    {
        type            wall;
        inGroups        1(wall);
        nFaces          3184;
        startFace       808922;
    }
)

// ************************************************************************* //
